###############################################################################
# Created by write_sdc
###############################################################################
current_design counter_all
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100000000.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day_num[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day_num[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day_num[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day_num[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day_num[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dec[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dec[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dec[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dec[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dec[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dec[5]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en[5]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour_num[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour_num[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour_num[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour_num[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour_num[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inc[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inc[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inc[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inc[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inc[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inc[5]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset_n}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_dec[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_dec[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_dec[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_dec[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_dec[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_inc[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_inc[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_inc[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_inc[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done_inc[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {day[4]}]
set_load -pin_load 0.0334 [get_ports {day[3]}]
set_load -pin_load 0.0334 [get_ports {day[2]}]
set_load -pin_load 0.0334 [get_ports {day[1]}]
set_load -pin_load 0.0334 [get_ports {day[0]}]
set_load -pin_load 0.0334 [get_ports {done_dec[4]}]
set_load -pin_load 0.0334 [get_ports {done_dec[3]}]
set_load -pin_load 0.0334 [get_ports {done_dec[2]}]
set_load -pin_load 0.0334 [get_ports {done_dec[1]}]
set_load -pin_load 0.0334 [get_ports {done_dec[0]}]
set_load -pin_load 0.0334 [get_ports {done_inc[4]}]
set_load -pin_load 0.0334 [get_ports {done_inc[3]}]
set_load -pin_load 0.0334 [get_ports {done_inc[2]}]
set_load -pin_load 0.0334 [get_ports {done_inc[1]}]
set_load -pin_load 0.0334 [get_ports {done_inc[0]}]
set_load -pin_load 0.0334 [get_ports {hour[4]}]
set_load -pin_load 0.0334 [get_ports {hour[3]}]
set_load -pin_load 0.0334 [get_ports {hour[2]}]
set_load -pin_load 0.0334 [get_ports {hour[1]}]
set_load -pin_load 0.0334 [get_ports {hour[0]}]
set_load -pin_load 0.0334 [get_ports {minute[5]}]
set_load -pin_load 0.0334 [get_ports {minute[4]}]
set_load -pin_load 0.0334 [get_ports {minute[3]}]
set_load -pin_load 0.0334 [get_ports {minute[2]}]
set_load -pin_load 0.0334 [get_ports {minute[1]}]
set_load -pin_load 0.0334 [get_ports {minute[0]}]
set_load -pin_load 0.0334 [get_ports {month[3]}]
set_load -pin_load 0.0334 [get_ports {month[2]}]
set_load -pin_load 0.0334 [get_ports {month[1]}]
set_load -pin_load 0.0334 [get_ports {month[0]}]
set_load -pin_load 0.0334 [get_ports {second[5]}]
set_load -pin_load 0.0334 [get_ports {second[4]}]
set_load -pin_load 0.0334 [get_ports {second[3]}]
set_load -pin_load 0.0334 [get_ports {second[2]}]
set_load -pin_load 0.0334 [get_ports {second[1]}]
set_load -pin_load 0.0334 [get_ports {second[0]}]
set_load -pin_load 0.0334 [get_ports {year[6]}]
set_load -pin_load 0.0334 [get_ports {year[5]}]
set_load -pin_load 0.0334 [get_ports {year[4]}]
set_load -pin_load 0.0334 [get_ports {year[3]}]
set_load -pin_load 0.0334 [get_ports {year[2]}]
set_load -pin_load 0.0334 [get_ports {year[1]}]
set_load -pin_load 0.0334 [get_ports {year[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day_num[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day_num[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day_num[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day_num[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day_num[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dec[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dec[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dec[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dec[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dec[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dec[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour_num[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour_num[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour_num[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour_num[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour_num[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inc[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inc[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inc[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inc[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inc[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inc[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
