###############################################################################
# Created by write_sdc
###############################################################################
current_design clock_century
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 1000000000.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_hour[0]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_hour[1]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_hour[2]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_hour[3]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_hour[4]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_i}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_min[0]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_min[1]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_min[2]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_min[3]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_min[4]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_min[5]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {am_pm}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {button_dec}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {button_inc}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mode[0]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mode[1]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset_n}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select[0]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select[1]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select[2]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select[3]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select[4]}]
set_input_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select[5]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alarm_o}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[0]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[10]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[11]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[12]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[13]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[1]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[2]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[3]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[4]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[5]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[6]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[7]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[8]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[9]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[0]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[10]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[11]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[12]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[13]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[1]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[2]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[3]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[4]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[5]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[6]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[7]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[8]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[9]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[0]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[10]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[11]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[12]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[13]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[1]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[2]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[3]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[4]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[5]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[6]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[7]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[8]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[9]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[0]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[10]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[11]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[12]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[13]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[1]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[2]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[3]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[4]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[5]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[6]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[7]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[8]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[9]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[0]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[10]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[11]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[12]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[13]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[1]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[2]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[3]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[4]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[5]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[6]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[7]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[8]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[9]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[0]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[10]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[11]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[12]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[13]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[1]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[2]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[3]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[4]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[5]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[6]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[7]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[8]}]
set_output_delay 200000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {alarm_o}]
set_load -pin_load 0.0334 [get_ports {led_day[13]}]
set_load -pin_load 0.0334 [get_ports {led_day[12]}]
set_load -pin_load 0.0334 [get_ports {led_day[11]}]
set_load -pin_load 0.0334 [get_ports {led_day[10]}]
set_load -pin_load 0.0334 [get_ports {led_day[9]}]
set_load -pin_load 0.0334 [get_ports {led_day[8]}]
set_load -pin_load 0.0334 [get_ports {led_day[7]}]
set_load -pin_load 0.0334 [get_ports {led_day[6]}]
set_load -pin_load 0.0334 [get_ports {led_day[5]}]
set_load -pin_load 0.0334 [get_ports {led_day[4]}]
set_load -pin_load 0.0334 [get_ports {led_day[3]}]
set_load -pin_load 0.0334 [get_ports {led_day[2]}]
set_load -pin_load 0.0334 [get_ports {led_day[1]}]
set_load -pin_load 0.0334 [get_ports {led_day[0]}]
set_load -pin_load 0.0334 [get_ports {led_hour[13]}]
set_load -pin_load 0.0334 [get_ports {led_hour[12]}]
set_load -pin_load 0.0334 [get_ports {led_hour[11]}]
set_load -pin_load 0.0334 [get_ports {led_hour[10]}]
set_load -pin_load 0.0334 [get_ports {led_hour[9]}]
set_load -pin_load 0.0334 [get_ports {led_hour[8]}]
set_load -pin_load 0.0334 [get_ports {led_hour[7]}]
set_load -pin_load 0.0334 [get_ports {led_hour[6]}]
set_load -pin_load 0.0334 [get_ports {led_hour[5]}]
set_load -pin_load 0.0334 [get_ports {led_hour[4]}]
set_load -pin_load 0.0334 [get_ports {led_hour[3]}]
set_load -pin_load 0.0334 [get_ports {led_hour[2]}]
set_load -pin_load 0.0334 [get_ports {led_hour[1]}]
set_load -pin_load 0.0334 [get_ports {led_hour[0]}]
set_load -pin_load 0.0334 [get_ports {led_min[13]}]
set_load -pin_load 0.0334 [get_ports {led_min[12]}]
set_load -pin_load 0.0334 [get_ports {led_min[11]}]
set_load -pin_load 0.0334 [get_ports {led_min[10]}]
set_load -pin_load 0.0334 [get_ports {led_min[9]}]
set_load -pin_load 0.0334 [get_ports {led_min[8]}]
set_load -pin_load 0.0334 [get_ports {led_min[7]}]
set_load -pin_load 0.0334 [get_ports {led_min[6]}]
set_load -pin_load 0.0334 [get_ports {led_min[5]}]
set_load -pin_load 0.0334 [get_ports {led_min[4]}]
set_load -pin_load 0.0334 [get_ports {led_min[3]}]
set_load -pin_load 0.0334 [get_ports {led_min[2]}]
set_load -pin_load 0.0334 [get_ports {led_min[1]}]
set_load -pin_load 0.0334 [get_ports {led_min[0]}]
set_load -pin_load 0.0334 [get_ports {led_month[13]}]
set_load -pin_load 0.0334 [get_ports {led_month[12]}]
set_load -pin_load 0.0334 [get_ports {led_month[11]}]
set_load -pin_load 0.0334 [get_ports {led_month[10]}]
set_load -pin_load 0.0334 [get_ports {led_month[9]}]
set_load -pin_load 0.0334 [get_ports {led_month[8]}]
set_load -pin_load 0.0334 [get_ports {led_month[7]}]
set_load -pin_load 0.0334 [get_ports {led_month[6]}]
set_load -pin_load 0.0334 [get_ports {led_month[5]}]
set_load -pin_load 0.0334 [get_ports {led_month[4]}]
set_load -pin_load 0.0334 [get_ports {led_month[3]}]
set_load -pin_load 0.0334 [get_ports {led_month[2]}]
set_load -pin_load 0.0334 [get_ports {led_month[1]}]
set_load -pin_load 0.0334 [get_ports {led_month[0]}]
set_load -pin_load 0.0334 [get_ports {led_sec[13]}]
set_load -pin_load 0.0334 [get_ports {led_sec[12]}]
set_load -pin_load 0.0334 [get_ports {led_sec[11]}]
set_load -pin_load 0.0334 [get_ports {led_sec[10]}]
set_load -pin_load 0.0334 [get_ports {led_sec[9]}]
set_load -pin_load 0.0334 [get_ports {led_sec[8]}]
set_load -pin_load 0.0334 [get_ports {led_sec[7]}]
set_load -pin_load 0.0334 [get_ports {led_sec[6]}]
set_load -pin_load 0.0334 [get_ports {led_sec[5]}]
set_load -pin_load 0.0334 [get_ports {led_sec[4]}]
set_load -pin_load 0.0334 [get_ports {led_sec[3]}]
set_load -pin_load 0.0334 [get_ports {led_sec[2]}]
set_load -pin_load 0.0334 [get_ports {led_sec[1]}]
set_load -pin_load 0.0334 [get_ports {led_sec[0]}]
set_load -pin_load 0.0334 [get_ports {led_year[13]}]
set_load -pin_load 0.0334 [get_ports {led_year[12]}]
set_load -pin_load 0.0334 [get_ports {led_year[11]}]
set_load -pin_load 0.0334 [get_ports {led_year[10]}]
set_load -pin_load 0.0334 [get_ports {led_year[9]}]
set_load -pin_load 0.0334 [get_ports {led_year[8]}]
set_load -pin_load 0.0334 [get_ports {led_year[7]}]
set_load -pin_load 0.0334 [get_ports {led_year[6]}]
set_load -pin_load 0.0334 [get_ports {led_year[5]}]
set_load -pin_load 0.0334 [get_ports {led_year[4]}]
set_load -pin_load 0.0334 [get_ports {led_year[3]}]
set_load -pin_load 0.0334 [get_ports {led_year[2]}]
set_load -pin_load 0.0334 [get_ports {led_year[1]}]
set_load -pin_load 0.0334 [get_ports {led_year[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {am_pm}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {button_dec}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {button_inc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_hour[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_hour[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_hour[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_hour[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_hour[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_min[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_min[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_min[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_min[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_min[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alarm_min[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mode[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mode[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
