###############################################################################
# Created by write_sdc
###############################################################################
current_design decode_all
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100000000.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {day[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hour[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {minute[5]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {month[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {second[5]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[0]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[1]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[2]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[3]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[4]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[5]}]
set_input_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {year[6]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[10]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[11]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[12]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[13]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[6]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[7]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[8]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_day[9]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[10]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[11]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[12]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[13]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[6]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[7]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[8]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_hour[9]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[10]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[11]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[12]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[13]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[6]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[7]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[8]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_min[9]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[10]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[11]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[12]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[13]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[6]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[7]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[8]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_month[9]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[10]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[11]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[12]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[13]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[6]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[7]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[8]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_sec[9]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[0]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[10]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[11]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[12]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[13]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[1]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[2]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[3]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[4]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[5]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[6]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[7]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[8]}]
set_output_delay 20000000.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_year[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {led_day[13]}]
set_load -pin_load 0.0334 [get_ports {led_day[12]}]
set_load -pin_load 0.0334 [get_ports {led_day[11]}]
set_load -pin_load 0.0334 [get_ports {led_day[10]}]
set_load -pin_load 0.0334 [get_ports {led_day[9]}]
set_load -pin_load 0.0334 [get_ports {led_day[8]}]
set_load -pin_load 0.0334 [get_ports {led_day[7]}]
set_load -pin_load 0.0334 [get_ports {led_day[6]}]
set_load -pin_load 0.0334 [get_ports {led_day[5]}]
set_load -pin_load 0.0334 [get_ports {led_day[4]}]
set_load -pin_load 0.0334 [get_ports {led_day[3]}]
set_load -pin_load 0.0334 [get_ports {led_day[2]}]
set_load -pin_load 0.0334 [get_ports {led_day[1]}]
set_load -pin_load 0.0334 [get_ports {led_day[0]}]
set_load -pin_load 0.0334 [get_ports {led_hour[13]}]
set_load -pin_load 0.0334 [get_ports {led_hour[12]}]
set_load -pin_load 0.0334 [get_ports {led_hour[11]}]
set_load -pin_load 0.0334 [get_ports {led_hour[10]}]
set_load -pin_load 0.0334 [get_ports {led_hour[9]}]
set_load -pin_load 0.0334 [get_ports {led_hour[8]}]
set_load -pin_load 0.0334 [get_ports {led_hour[7]}]
set_load -pin_load 0.0334 [get_ports {led_hour[6]}]
set_load -pin_load 0.0334 [get_ports {led_hour[5]}]
set_load -pin_load 0.0334 [get_ports {led_hour[4]}]
set_load -pin_load 0.0334 [get_ports {led_hour[3]}]
set_load -pin_load 0.0334 [get_ports {led_hour[2]}]
set_load -pin_load 0.0334 [get_ports {led_hour[1]}]
set_load -pin_load 0.0334 [get_ports {led_hour[0]}]
set_load -pin_load 0.0334 [get_ports {led_min[13]}]
set_load -pin_load 0.0334 [get_ports {led_min[12]}]
set_load -pin_load 0.0334 [get_ports {led_min[11]}]
set_load -pin_load 0.0334 [get_ports {led_min[10]}]
set_load -pin_load 0.0334 [get_ports {led_min[9]}]
set_load -pin_load 0.0334 [get_ports {led_min[8]}]
set_load -pin_load 0.0334 [get_ports {led_min[7]}]
set_load -pin_load 0.0334 [get_ports {led_min[6]}]
set_load -pin_load 0.0334 [get_ports {led_min[5]}]
set_load -pin_load 0.0334 [get_ports {led_min[4]}]
set_load -pin_load 0.0334 [get_ports {led_min[3]}]
set_load -pin_load 0.0334 [get_ports {led_min[2]}]
set_load -pin_load 0.0334 [get_ports {led_min[1]}]
set_load -pin_load 0.0334 [get_ports {led_min[0]}]
set_load -pin_load 0.0334 [get_ports {led_month[13]}]
set_load -pin_load 0.0334 [get_ports {led_month[12]}]
set_load -pin_load 0.0334 [get_ports {led_month[11]}]
set_load -pin_load 0.0334 [get_ports {led_month[10]}]
set_load -pin_load 0.0334 [get_ports {led_month[9]}]
set_load -pin_load 0.0334 [get_ports {led_month[8]}]
set_load -pin_load 0.0334 [get_ports {led_month[7]}]
set_load -pin_load 0.0334 [get_ports {led_month[6]}]
set_load -pin_load 0.0334 [get_ports {led_month[5]}]
set_load -pin_load 0.0334 [get_ports {led_month[4]}]
set_load -pin_load 0.0334 [get_ports {led_month[3]}]
set_load -pin_load 0.0334 [get_ports {led_month[2]}]
set_load -pin_load 0.0334 [get_ports {led_month[1]}]
set_load -pin_load 0.0334 [get_ports {led_month[0]}]
set_load -pin_load 0.0334 [get_ports {led_sec[13]}]
set_load -pin_load 0.0334 [get_ports {led_sec[12]}]
set_load -pin_load 0.0334 [get_ports {led_sec[11]}]
set_load -pin_load 0.0334 [get_ports {led_sec[10]}]
set_load -pin_load 0.0334 [get_ports {led_sec[9]}]
set_load -pin_load 0.0334 [get_ports {led_sec[8]}]
set_load -pin_load 0.0334 [get_ports {led_sec[7]}]
set_load -pin_load 0.0334 [get_ports {led_sec[6]}]
set_load -pin_load 0.0334 [get_ports {led_sec[5]}]
set_load -pin_load 0.0334 [get_ports {led_sec[4]}]
set_load -pin_load 0.0334 [get_ports {led_sec[3]}]
set_load -pin_load 0.0334 [get_ports {led_sec[2]}]
set_load -pin_load 0.0334 [get_ports {led_sec[1]}]
set_load -pin_load 0.0334 [get_ports {led_sec[0]}]
set_load -pin_load 0.0334 [get_ports {led_year[13]}]
set_load -pin_load 0.0334 [get_ports {led_year[12]}]
set_load -pin_load 0.0334 [get_ports {led_year[11]}]
set_load -pin_load 0.0334 [get_ports {led_year[10]}]
set_load -pin_load 0.0334 [get_ports {led_year[9]}]
set_load -pin_load 0.0334 [get_ports {led_year[8]}]
set_load -pin_load 0.0334 [get_ports {led_year[7]}]
set_load -pin_load 0.0334 [get_ports {led_year[6]}]
set_load -pin_load 0.0334 [get_ports {led_year[5]}]
set_load -pin_load 0.0334 [get_ports {led_year[4]}]
set_load -pin_load 0.0334 [get_ports {led_year[3]}]
set_load -pin_load 0.0334 [get_ports {led_year[2]}]
set_load -pin_load 0.0334 [get_ports {led_year[1]}]
set_load -pin_load 0.0334 [get_ports {led_year[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {day[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hour[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {minute[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {minute[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {minute[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {minute[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {minute[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {minute[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {month[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {month[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {month[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {month[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {second[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {second[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {second[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {second[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {second[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {second[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {year[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {year[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {year[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {year[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {year[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {year[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {year[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
